DataProcessors/МИКОст_НеобработаныеЗвонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МИКОст_НеобработаныеЗвонки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/МИКО_стВидыТелефонныхЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МИКО_стВидыТелефонныхЗвонков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/МИКО_стЗаписьИсторииЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МИКО_стЗаписьИсторииЗвонков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Start</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Answer</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Billsec</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Disposition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_стВидыТелефонныхЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastApp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пропущенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutLine</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МИКО_стУчетныеЗаписиАТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recordingfile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетСоединений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>channel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>dstchannel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛожныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>linkedid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>did</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>accountcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src_Владелец_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst_Владелец_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>roistatid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_pbx</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IdQueue</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgentQueue</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgentQueue_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтвеченВВайбере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетализацияCEL</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Eventtime</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cidnum</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Peer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Appname</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndTime</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДлительности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МИКО_стВидыТелефонныхЗвонков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cidnum_ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Peer_ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Src_Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst_Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>channel</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>dstchannel</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CDR_ПропустившиеЗвонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Disposition</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst_Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst_ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыСобытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Событие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИменаФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/МИКОст_НеобработаныеЗвонки/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	MIKO_Asterisk_Подключена = Метаданные.Обработки.Найти("MIKO_Asterisk")<>Неопределено;
	МИКО_ПанельТелефонииДля1С_Подключена = Метаданные.Обработки.Найти("МИКО_ПанельТелефонииДля1С")<>Неопределено;
	ПанельТелефонииЕсть = (MIKO_Asterisk_Подключена ИЛИ МИКО_ПанельТелефонииДля1С_Подключена);
	Элементы.дПрослушатьЗапись.Видимость	= ПанельТелефонииЕсть;
	Элементы.дСкачатьЗапись.Видимость 		= ПанельТелефонииЕсть;
	Элементы.ОткрытьСобытие.Видимость 		= ПанельТелефонииЕсть;
	Элементы.ДобавитьНомерКонтакту.Видимость= ПанельТелефонииЕсть;
	Элементы.Позвонить.Видимость 			= ПанельТелефонииЕсть;
	
	// Получим системную информацию
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;

	Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
	ВосстановитьНастройки();
	Элементы.представениеПериод.Заголовок = Период;
	
	СформироватьОтчет();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
    Настройки    = Новый Структура;
	Настройки.Вставить("ОтборДлительность", ОтборДлительность);
	Настройки.Вставить("Период", Период);
    ХранилищеОбщихНастроек.Сохранить("MIKO",  "НеобработанныеВызовы", Настройки, , ИмяПользователя());	
КонецПроцедуры
&НаСервере
Процедура ВосстановитьНастройки()
	Попытка
	СтанцияMyPBX = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.СтанцияMyPBX();
	Исключение
	СтанцияMyPBX = Ложь;
	КонецПопытки; 
	
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("MIKO","НеобработанныеВызовы",,ИмяПользователя());
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек);
	КонецЕсли;

КонецПроцедуры
 
///
// Команды Формы и обработчики событий
///

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчет(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборДлительностьПриИзменении(Элемент)
	СформироватьОтчет(); 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	ОткрытьСотрудникаИлиДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьСотрудникаИлиДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСотрудникаИлиДокумент()

	ТекущиеДанные = Элементы.Результат.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаДокумент) Тогда
		ОткрытьЗначениеКлиент(ТекущиеДанные.СсылкаНаДокумент);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ПринялВызов) И ТипЗнч(ТекущиеДанные.ПринялВызов) <> Тип("Строка") Тогда	
		ОткрытьЗначениеКлиент(ТекущиеДанные.ПринялВызов);
	КонецЕсли; 

КонецПроцедуры // ОткрытьСотрудникаИлиДокументу()
 

&НаКлиенте
// Установка периода.
// 
Процедура УстановитьПериод(Команда)
	
	Если ВерсияПлатформы = "8.3" Тогда
		
		Если НЕ ИспользоватьРежимМодальности Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""УстановитьПериодНаФорме"", ЭтаФорма)");
			Попытка
				Выполнить("ОткрытьФорму(""ОбщаяФорма.МИКО_стВыборСтандартногоПериода"",,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОписаниеОповещения)");
			Исключение
				Возврат;
			КонецПопытки; 
		Иначе	
			вПериод = ОткрытьФормуМодально("ОбщаяФорма.МИКО_стВыборСтандартногоПериода");
			УстановитьПериодНаФорме(вПериод);
		КонецЕсли; 
		
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		
		вПериод = ОткрытьФормуМодально("ОбщаяФорма.МИКО_стВыборСтандартногоПериода");
	
		УстановитьПериодНаФорме(вПериод);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНомерКонтакту(Команда)
	ТекущиеДанные = Элементы.Результат.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	Если Miko_Ajam = Неопределено И сфпФормаТелефон = Неопределено Тогда
		ТекстСообщения = "Продукт ""Панель телефонии для 1С не встроен в конфигурацию.""";
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		Возврат;
	КонецЕсли; 
	
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile,linkedid");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.СсылкаНаДокумент) = Ложь Тогда
		// Внутренний вызов.
		Возврат;
	КонецЕсли;

	врПараметры = Новый Структура;
	врПараметры.Вставить("НомерТелефона", 		Вызов.НомерТелефона);
	врПараметры.Вставить("КонтактКНазначению",  Вызов.Партнер);
	врПараметры.Вставить("Абонент", 			Вызов.Абонент);
		
	Если сфпФормаТелефон <> Неопределено Тогда
		// Управляемое приложение.
		Оповестить("ДобавитьНомерКонтакту",врПараметры,ЭтаФорма);
		Возврат;
	КонецЕсли;	
	
	врПараметры.Вставить("Контрагент", 		 	Вызов.Партнер);
	врПараметры.Вставить("КонтактноеЛицо", 		Вызов.Абонент);
	// Обычное приложение.
	ОбъектКИ = Неопределено;
	Если ЗначениеЗаполнено(врПараметры.КонтактноеЛицо) Тогда
	 	ОбъектКИ = врПараметры.КонтактноеЛицо;
	ИначеЕсли ЗначениеЗаполнено(врПараметры.Контрагент) 
		 	  И ТипЗнч(врПараметры.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОбъектКИ = врПараметры.Контрагент;
	Иначе
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		// Сперва предложим пользователю выбрать контрагента.
		ФормаВыбораКонтрагента = Вычислить("Справочники.Контрагенты.ПолучитьФормуВыбора()");
		ОбъектКИ 			   = ФормаВыбораКонтрагента.ОткрытьМодально();
		#КонецЕсли 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ОбъектКИ) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.СоздатьНомерКИ(Неопределено, ОбъектКИ, Неопределено, Вызов.НомерТелефона);	
		Исключение
		КонецПопытки;
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности назначить номер контакту.");	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
	Вызов = Элементы.Результат.ТекущиеДанные;
	Если Вызов = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Вызов.НомерТелефона) Тогда
	 	Возврат;
	КонецЕсли; 
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	
	Если Miko_Ajam <> Неопределено Тогда
		Miko_Ajam.НабратьНомер(Вызов.НомерТелефона);	
	Иначе
		врДанные = Новый Структура("ОснованиеЗвонка", Вызов.СсылкаНаДокумент);
		Оповестить("Позвонить", Вызов.НомерТелефона, врДанные);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
// Задействует механизм панели телефонии по созданию документа "Событие".
// 
Процедура СоздатьСтикер(Команда)
	ТекДанные = Элементы.Результат.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();		
	Если Miko_Ajam = Неопределено И сфпФормаТелефон = Неопределено Тогда
		ТекстСообщения = "Продукт ""Панель телефонии для 1С не встроен в конфигурацию.""";
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		Возврат;
	КонецЕсли; 
	
	Событие = ПолучитьСсылкуНаСобытие(ТекДанные.СсылкаНаДокумент);
	Если ЗначениеЗаполнено(Событие) Тогда
		Если Событие <> Неопределено Тогда
			Попытка
				Выполнить("ОткрытьЗначение(Событие)");
				Возврат;
			Исключение
			КонецПопытки;
			
			Попытка
				Выполнить("ПоказатьЗначение(,Событие)");				
				Возврат;
			Исключение
			КонецПопытки; 
		КонецЕсли; 
	Иначе
		Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile,linkedid");
		Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекДанные.СсылкаНаДокумент) = Ложь Тогда
			// Внутренний вызов.
			Возврат;
		КонецЕсли;
		// Управляемое приложение.
		Вызов.Вставить("UniqueID",		Вызов.linkedid);
		Вызов.Вставить("ВремяЗвонка",	ТекДанные.ДатаДокумента);
		Вызов.Вставить("Длительность",	ТекДанные.ДлительностьЗвонка);
		
		// Обычное приложение.
		Вызов.Вставить("ИдентификаторЗвонка",	Вызов.linkedid);
		Вызов.Вставить("Когда",					ТекДанные.ДатаДокумента);
		Вызов.Вставить("СекундДлился",			0);
		Вызов.Вставить("ВходящийЗвонок",		Вызов.Входящий);
		Вызов.Вставить("ПропущенныйЗвонок",		ТекДанные.НетСоединений);
		Вызов.Вставить("ДокументСобытие",		Неопределено);
		Вызов.Вставить("ИмяФайла",				"");         
		Вызов.Вставить("Контрагент",			Вызов.Партнер);         
		Вызов.Вставить("КонтактноеЛицо",		Вызов.Абонент);         
		    
		Если сфпФормаТелефон <> Неопределено Тогда
			врДанные = Новый Структура("Вызов,Пропущенный", Вызов, Истина);
			Оповестить("СоздатьСтикер",врДанные,ЭтаФорма);
		ИначеЕсли Miko_Ajam	<> Неопределено Тогда
			Попытка
				Miko_Ajam.ОткрытьСоздатьСобытие(Вызов.linkedid, Вызов);	
			Исключение
			КонецПопытки;
		Иначе
			МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности создать документ ""Событие"".");	
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Запуск обратного звонка для воспроизведения файла
// 
Процедура дПрослушатьЗапись(Команда)
	ТекущиеДанные = Элементы.Результат.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	 	Возврат;
	КонецЕсли; 
	
	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	
	Если СтанцияMyPBX = Истина Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.СсылкаНаДокумент, "recordingfile");
	 	ЗвонокИД = врДанные.recordingfile;
	Иначе 	
	 	ЗвонокИД = ТекущиеДанные.linkedid;
	КонецЕсли; 
	Если сфпФормаТелефон <> Неопределено Тогда
		ОжидаемЗапись = Истина;
		// сфпФормаТелефонВнешняяПанель.ПрослушатьЗвонокПоИдентификатору(ЗвонокИД); //.
		Оповестить("ВоспроизвестиЗапись", ЗвонокИД, ЭтаФорма);
	ИначеЕсли Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.ПрослушатьЗаписьРазговора(ЗвонокИД);
		Исключение
			// 	
		КонецПопытки;
	Иначе
		ТекстСообщения = "Продукт ""Панель телефонии для 1С не встроен в конфигурацию.""";
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Запуск процесса скачивания файла записи. 
//
Процедура дСкачатьЗапись(Команда)
	
	ТекущиеДанные = Элементы.Результат.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	 	Возврат;
	КонецЕсли; 
	
	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	
	Если сфпФормаТелефон <> Неопределено Тогда
		ОжидаемЗапись = Истина;
		Оповестить("СкачатьЗапись", ТекущиеДанные.linkedid, ЭтаФорма);
	ИначеЕсли Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.СкачатьЗаписьРазговора(ТекущиеДанные);
		Исключение
			// 	
		КонецПопытки;
	Иначе
		ТекстСообщения = "Продукт ""Панель телефонии для 1С не встроен в конфигурацию.""";
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли; 
	
КонецПроцедуры

///
// Прочее
///

// Производит заполнение дерева значений.
//
&НаСервере
Процедура СформироватьОтчет()

	Текст  = ПолучитьТекстЗапроса();
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДатаНачала",		Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОтборДлительность", 	ОтборДлительность * 60);
	
	Рез = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	ЗначениеВРеквизитФормы(Рез, "Результат");
	
	Для каждого Группировки Из Результат.ПолучитьЭлементы() Цикл
		
		Если ТипЗнч(Группировки.ПринялВызов) = Тип("Строка") Тогда
			// это номер телефона (или то, что в поле dst)
		КонецЕсли; 
		
		ЭлементыГруппировки = Группировки.ПолучитьЭлементы();
		Группировки.Всего = ""+ЭлементыГруппировки.Количество()+" шт.";
		Для каждого СтрокиРасшифровки Из ЭлементыГруппировки Цикл
			СтрокиРасшифровки.ПринялВызов = "" + СтрокиРасшифровки.НаправлениеЗвонка + " вызов от " + Формат(СтрокиРасшифровки.ДатаДокумента, "ДЛФ=DDT");	
			СтрокиРасшифровки.Всего = ""+Формат(СтрокиРасшифровки.ДлительностьЗвонка / 60, "ЧДЦ=1; ЧН=0; ЧГ=") + " мин.";	
		КонецЦикла;
	КонецЦикла; 

	
КонецПроцедуры // СформироватьОтчет()
&НаСервере
Функция ПолучитьТекстЗапроса()

	Текст = "ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА МИКО_стЗаписьИсторииЗвонков.Направление = ЗНАЧЕНИЕ(Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий)
	        |			ТОГДА ВЫБОР
	        |					КОГДА МИКО_стЗаписьИсторииЗвонков.Dst_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
	        |							И МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка = НЕОПРЕДЕЛЕНО
	        |						ТОГДА МИКО_стЗаписьИсторииЗвонков.Dst
	        |					КОГДА МИКО_стЗаписьИсторииЗвонков.Dst_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
	        |						ТОГДА МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка
	        |					ИНАЧЕ МИКО_стЗаписьИсторииЗвонков.Dst_Владелец_Ссылка
	        |				КОНЕЦ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
	        |						И МИКО_стЗаписьИсторииЗвонков.Src_Ссылка = НЕОПРЕДЕЛЕНО
	        |					ТОГДА МИКО_стЗаписьИсторииЗвонков.Src
	        |				КОГДА МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
	        |					ТОГДА МИКО_стЗаписьИсторииЗвонков.Src_Ссылка
	        |				ИНАЧЕ МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ПринялВызов,
	        |	МИКО_стЗаписьИсторииЗвонков.Дата КАК ДатаДокумента,
	        |	ВЫБОР
	        |		КОГДА МИКО_стЗаписьИсторииЗвонков.Направление = ЗНАЧЕНИЕ(Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий)
	        |			ТОГДА МИКО_стЗаписьИсторииЗвонков.Src
	        |		ИНАЧЕ МИКО_стЗаписьИсторииЗвонков.Dst
	        |	КОНЕЦ КАК НомерТелефона,
	        |	МИКО_стЗаписьИсторииЗвонков.Направление КАК НаправлениеЗвонка,
	        |	ВЫБОР
	        |		КОГДА МИКО_стЗаписьИсторииЗвонков.Направление = ЗНАЧЕНИЕ(Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий)
	        |			ТОГДА ВЫБОР
	        |					КОГДА МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
	        |						ТОГДА МИКО_стЗаписьИсторииЗвонков.Src_Ссылка
	        |					ИНАЧЕ МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка
	        |				КОНЕЦ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА МИКО_стЗаписьИсторииЗвонков.Dst_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
	        |					ТОГДА МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка
	        |				ИНАЧЕ МИКО_стЗаписьИсторииЗвонков.Dst_Владелец_Ссылка
	        |			КОНЕЦ
	        |	КОНЕЦ КАК КлиентСсылка,
	        |	МИКО_стЗаписьИсторииЗвонков.Billsec КАК ДлительностьЗвонка,
	        |	МИКО_стЗаписьИсторииЗвонков.Ссылка КАК СсылкаНаДокумент,
	        |	МИКО_стЗаписьИсторииЗвонков.НетСоединений КАК НетСоединений,
	        |	"""" КАК Всего,
	        |	МИКО_стЗаписьИсторииЗвонков.linkedid
	        |ИЗ
	        |	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
	        |ГДЕ
	        |	МИКО_стЗаписьИсторииЗвонков.Направление <> ЗНАЧЕНИЕ(Перечисление.МИКО_стВидыТелефонныхЗвонков.Внутренний)
	        |	И (МИКО_стЗаписьИсторииЗвонков.Src_Ссылка = НЕОПРЕДЕЛЕНО
	        |				И МИКО_стЗаписьИсторииЗвонков.Направление = ЗНАЧЕНИЕ(Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий)
	        |			ИЛИ МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка = НЕОПРЕДЕЛЕНО
	        |				И МИКО_стЗаписьИсторииЗвонков.Направление = ЗНАЧЕНИЕ(Перечисление.МИКО_стВидыТелефонныхЗвонков.Исходящий))
	        |	И МИКО_стЗаписьИсторииЗвонков.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	        |	И МИКО_стЗаписьИсторииЗвонков.Billsec >= &ОтборДлительность
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаДокумента УБЫВ
	        |ИТОГИ ПО
	        |	ПринялВызов";
	Возврат Текст;
КонецФункции // ПолучитьТекстЗапроса()

&НаСервереБезКонтекста
// Вспомогательная функция, получает данные по документу "МИКО_стЗаписьИсторииЗвонков".
// 
Функция ЗаполнитьПоДокументуИсторииЗвонков(Вызов, СсылкаНаДокумент)
	Если СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Внутренний") Тогда
		Возврат Ложь;	
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Src_Владелец_Ссылка,Src_Ссылка,Src,linkedid");
		Партнер				= врДанные.Src_Владелец_Ссылка;	
		Абонент 			= врДанные.Src_Ссылка;
		Вызов.НомерТелефона = врДанные.Src;
		Вызов.linkedid 	 	= врДанные.linkedid;
		Вызов.Входящий 		= Истина;
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Исходящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Dst_Владелец_Ссылка,Dst_Ссылка,Dst,linkedid");
		Партнер 			= врДанные.Dst_Владелец_Ссылка;	
		Абонент 			= врДанные.Dst_Ссылка;
		Вызов.НомерТелефона = врДанные.Dst;
		Вызов.linkedid 	 	= врДанные.linkedid;
		Вызов.Входящий 		= Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		Вызов.Партнер = Партнер;	
		Вызов.Абонент = Абонент;	
	Иначе
		Вызов.Партнер = Абонент;	
	КонецЕсли;
	
	РезульатЗапроса = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ИменаФайлов");
	Если НЕ РезульатЗапроса.Пустой() Тогда
		ИменаФайлов 		= РезульатЗапроса.Выгрузить();
		Вызов.ЕстьЗапись 	= Истина;
		Вызов.recordingfile = ИменаФайлов[0].ИмяФайла;
	Иначе	
		Вызов.ЕстьЗапись    = Ложь;
		Вызов.recordingfile = "";
	КонецЕсли; 
	
	Возврат Истина;	
КонецФункции

// Вспомогательная функция, получает ссылку на первый документ "Событие".
// 
Функция ПолучитьСсылкуНаСобытие(СсылкаНаДокумент)
	
	РезульатЗапроса = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ДокументыСобытие");
	Если НЕ РезульатЗапроса.Пустой() Тогда
		ДокументыСобытие = РезульатЗапроса.Выгрузить();
		Событие = ДокументыСобытие[0].Событие;
	Иначе	
	    Событие = Неопределено;
	КонецЕсли; 
	
	Возврат Событие;
КонецФункции // ПолучитьСсылкуНаСобытие()

// Открывает значение. 
//
&НаКлиенте
Процедура ОткрытьЗначениеКлиент(Клиент)

	Если ЗначениеЗаполнено(Клиент) Тогда
		Попытка
			Выполнить("ОткрытьЗначение(Клиент)");
			Возврат;
		Исключение
		КонецПопытки;
		
		Попытка
			Выполнить("ПоказатьЗначение(,Клиент)");				
			Возврат;
		Исключение
		КонецПопытки; 
	КонецЕсли; 

КонецПроцедуры // ОткрытьЗначениеКлиент()

&НаКлиенте
// Выбор периода.
// 
Процедура УстановитьПериодНаФорме(Результат, ДопПараметры = Неопределено) Экспорт

	Если НЕ Результат = Неопределено Тогда
		Период = Результат;
		Элементы.представениеПериод.Заголовок 	= ""+Период;
		СформироватьОтчет();
	КонецЕсли; 

КонецПроцедуры // УстановитьПериодНаФорме()
